tutorials/multiphase/interImmersedBoundaryFoam/dropletOnIBWall/meshWall/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 0
    volScalarFieldValue voidFraction 1
);

regions
(
    sphereToCell
    {
        centre (0.005 0.005 0.001);
        radius 0.001;
        fieldValues
        (
            volScalarFieldValue alpha1 1
        );
    }
    
    boxToCell
    {
        box (0 0 -1) (0.01 0.01 0.001);

        fieldValues
        (
            volScalarFieldValue voidFraction 1
        );
    }
);


// ************************************************************************* //
